import Image from "next/image";

const Details = () => {
  return (
    <div className="container">
      <div className="flex flex-col items-center justify-center">
        <div className="p-20">
          <div className="mb-4 flex items-center justify-center gap-20 text-center">
            <Image
              src="/айсулуу.webp"
              alt="Айсулуу Тыныбекова"
              width={350}
              height={220}
              className="object-cover"
            />
            <p className="mb-4 w-65 text-start text-[18px] text-gray-300">
              Жарандыгы: Кыргызстан · Спорт: Эркин күрөш · Туулган күнү: 4-май
              1993 (32 жаш) · Туулган жери: Майлуу-Суу, Жалал-Абад облусу · Бою:
              170 см · Салмагы: 62 кг · Машыктыруучу: Нурбек Изабеков
            </p>
          </div>
          <h1
            style={{ fontFamily: "cursive" }}
            className="text-2xl font-bold text-center pt-10 font-curive"
          >
            Тыныбекова Айсулуу Болотовна
          </h1>
          <br />
          <div className="flex items-center flex-col gap-10">
            <p className="mb-6 w-320 text-[19px] text- leading-relaxed text-gray-200">
              1993-жылдын 4-майында Жалал-Абад облусунун Майлуу-Суу шаарында
              төрөлгөн. Үй-бүлөдө төртүнчү бала, эки эжеси, ага-иниси бар.
              Айсулуу бала кезинен баштап спортко жакын болуп өстү. Спортко
              жакын болушуна апасы чоң салым кошкон. Үй-бүлөдө өзгөчө салт бар:
              баары күн сайын эртең менен чуркашат[1]. Айсулуу 8-класска чейин
              мектептин баскетбол командасынын капитаны болгон. 9-классты
              бүтүргөнгө чейин каратэ менен машыгып жүргөн. 10-классында эркин
              күрөш менен алектене баштаган. Ата-энесин колдоосуна ээ болуп,
              профессионалдык спорт менен машыгуу үчүн Бишкекке көчүп келген[1].
              Залда маттар болбогондуктан, күрөш ыкмаларына матрацтарда
              үйрөнгөн. Кесипкөй болуп, өзүнүн үстүнөн иштеп, дүйнөлүк чемпион
              болуу каалоосу спортчуга үйдү жана ата-энесине болгон сагыныч
              сезимин жеңүүгө жардам берген[1]. Эгемен Кыргызстандын тарыхында
              спорттун Олимпиадалык түрлөрүнөн Дүйнө чемпиону болгон алгачкы
              кыргызстандык спортчу. Ал ошондой эле күрөш боюнча Дүйнө
              чемпионатынын финалында эки жолу күрөшүп, эки жолу тең жеңишке
              жеткен алгачкы кыргызстандык. Чыңгыз Айтматов атындагы Мамлекеттик
              жаштар сыйлыгынын лауреаты.
              <span className="ml-2 cursor-pointer text-yellow-400 hover:underline">
                ПОДРОБНЕЕ...
              </span>
            </p>

            <div className="mb-6 flex justify-center gap-6">
              <Image src="/aisuluu1.svg" alt="icon" width={360} height={60} />
              <Image src="/aisuluu2.svg" alt="icon" width={360} height={60} />
              <Image src="/aisuluu3.jpg" alt="icon" width={390} height={60} />
            </div>

            <p className="mb-6 text-[16px] rounded-lg leading-relaxed text-gray-300 p-10 border border-yellow-200">
              2010-ж. аялдар күрөшү боюнча Азия чемпионатында коло медалды уткан
              жана жаштар арасында Азиянын чемпиону болуп калган. 2012-ж. Лондон
              Олимпиадасынын катышуучусу. Эл аралык турнирлерде бир нече жолу
              утушка жетишкен. 2013-ж. Азия чемпионатынын коло медалынын женген.
              РФ Казан шаарында өткөн Дүйнөлүк Студенттик олимпиадада коло
              медалга ээ болгон. 2014-ж. Түштүк Кореянын Инчхон шаарында өткөн
              XIV Азия оюндарынын коло медалы 2015-ж. Орусияда өткөн Олимпиада
              чемпиону Иван Ярыгиндин Гран-присинин күмүш медалы. 2014-2015-жж.
              Азия чемпионатынын күмүш медалы 2016-ж. Таиланддын борбору Бангкок
              шаарында өткөн Азия чемпионатында, 58 килограмм салмактагы
              категорияда атаандаштарын утуп, Азиянын чемпиону болду.
              Машыктыруучулары - КРнын эмгек сиңирген машыктыруучусу Нурбек
              Изабеков жана Түгөлбай Базакечов. 2018-ж. XVIII Азия оюндарынын
              чемпиону. Индонезия. 2019-ж. Дүйнө чемпиону. Нур-Султан,
              Казакстан. 2020-ж. Дүйнө Кубогунун жеңүүчүсү. Белград, Сербия.
              2021-ж. Токио олимпиадасынын күмүш медалынын ээси 2021-ж. Дүйнө
              чемпиону. Осло, Норвегия. 62 кг. 2023-ж. Дүйнө чемпиону. Белград,
              Сербия. 62 кг. 2024-ж. Париж олимпиадасынын коло медалынын ээси
            </p>
            <div className="flex flex-col gap-5 justify-center">
              <h2 className="text-[32px] font-semibold">
                Айсулуу Тыныбекова — үч жолку Азия чемпиону
              </h2>
              <Image
                src="/image 14.svg"
                alt="news"
                width={800}
                height={80}
                className="mx-auto rounded-xl"
              />
            </div>
          </div>
        </div>
      </div>

      <div className=" flex flex-col  gap-10 pb-10">
        <h2 style={{fontFamily:"monospace"}} className="mb-6 text-[30px] text-center font-bold">
          Также интересно
        </h2>
        <div className="flex items-start gap-30">
          <div className="">
            <Image src="/image 20.svg" alt="news" width={280} height={120} />
            <p className="mt-3 w-70 text-[16px] text-gray-300">
              Самат «Кыргыз» Абдрахманов завоевал второй чемпионский титул
            </p>
          </div>

          <div className="">
            <Image src="/footbol.svg" alt="news" width={270} height={120} />
            <p className="mt-3 text-[16px] w-70 text-gray-300">
              Эржан Нурланович Токотаев — кыргызский футболист
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Details;
